* Stop all running Docker containers
  #+BEGIN_SRC sh :dir /sudo::
  docker stop $(docker ps -a -q)
  #+END_SRC

  #+RESULTS:
  | 9828a0c59ce2 |
  | 656c5f3e9b71 |

* Remove all Docker containers
  #+BEGIN_SRC sh :dir /sudo::
  docker rm $(docker ps -a -q)
  #+END_SRC

  #+RESULTS:
  | 9828a0c59ce2 |
  | 656c5f3e9b71 |

** Inspecting the Consul Cluster

   Visit http://localhost:8500/ui to inspect the Web UI to your Consult cluster.

   Get your consul nodes via the HTTP API:
   #+BEGIN_SRC sh
   curl localhost:8500/v1/catalog/nodes
   #+END_SRC

   #+RESULTS:
   | Node":"node1 | 172.17.0.1 | Node":"node2 | 172.17.0.2 | Node":"node3 | 172.17.0.3 | Node":"node4 | 10.6.200.170 |

   Get the available services via the HTTP API:
   #+BEGIN_SRC sh
   curl localhost:8500/v1/catalog/services
   #+END_SRC

   #+RESULTS:
   | consul | udp | consul-8300:[] | udp | udp | consul-8400:[] | consul-8500:[] | consul-exporter:[] | prometheus:[]} |

   Inspect the consul service:
   #+BEGIN_SRC sh
   curl localhost:8500/v1/catalog/service/consul
   #+END_SRC

   #+RESULTS:
   | Node":"node2 | 172.17.0.2 | consul | consul | ServiceTags:[] | ServiceAddress:"" | ServicePort:8300} | Node":"node1 | 172.17.0.1 | consul | consul | ServiceTags:[] | ServiceAddress:"" | ServicePort:8300} | Node":"node3 | 172.17.0.3 | consul | consul | ServiceTags:[] | ServiceAddress:"" | ServicePort:8300}] |

